# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов второго множества. 
# Затем пользователь вводит сами элементы множеств.

print()
n = int(input("Введите кол-во элементов первого множества: "))
print()
m = int(input("Введите кол-во элементов второго множества: "))

set1 = set()
set2 = set()

print()
print("Введите элементы первого множества:")
for i in range(n):
    set1.add(int(input()))

print()
print("Введите элементы второго множества:")
for i in range(m):
    set2.add(int(input()))

result_set = set1.intersection(set2)

print()
print("Результат:", sorted(result_set))
print()